{
  "architectures": ["Allin1Model"],
  "hidden_size": 24,
  "num_hidden_layers": 6,
  "num_attention_heads": 4,
  "intermediate_size": 96,
  "num_labels": 4,
  "model_type": "allin1",
  "use_cache": true,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2"
}
